Tekla Open API Reference for Tekla Structures 2025
DetailViewLabelMarkPropertyElementTypes Methods
The PropertyElement.PropertyElementType.DetailViewLabelMarkPropertyElementTypes type exposes the following members.
Methods
Name | Description
DetailName
Returns the detail name property element type.
DrawingName
Returns the drawing name property element type.
Scale
Returns the scale property element type.
SourceDrawingName
Returns the source drawing name property element type.
SourceDrawingNameWhenMoved
Returns the source drawing name when moved property element type.
Top
See Also
Reference
PropertyElement.PropertyElementType.DetailViewLabelMarkPropertyElementTypes Class
Tekla.Structures.Drawing Namespace